function user(name) {
  console.log(`გამარჯობა ${name}`);
}
user("JHON");

/*1. ფუნქცია არის კოდის ბლოკი,რომელსაც მრავალჯერ გამოვიყენებთ და აღარ მოგვიწევს ცალცალკე გაწერა. 
2.ფუნქციის გამოძახება ანუ,როდესაც ვიძახებთ ფუნქციას ასრულებს კოდს და შემდეგ უშუალოდ გამოძახების კოდს უბრუნდება 
3.ფუნქციაში შედის კოდის ბლოკი,მაგრამ კოდის ბლოკი არსებობობს ფუნქციის გარეშეც 
4. ?
5.?
6.ფუნქცია თვითონვე მიხვდება რა უნდა გამოიტანოს,თუ ჩვენ ეს არ გვიწერია
7.? 
8.ანუ დაბრუნება,აბრუნებს მნიშვნელობას 
9.ანუ იქნება undefined? 
10.x იქნება undefined
11.? 
12.? 
13.?

   მოსაძიებელი მასალა:
  1970 წლის 1 იანვარი მნიშვნელოვანი თარიღია ჯავასკრიპტისთვის და საერთოდ კომპიუტერულ მეცნიერებაში, 
რადგან ეს არის Unix Epoch-ის დასაწყისი - დროის ათვლის წერტილი Unix-ბაზირებული სისტემებისთვის. 
რატომ აირჩიეს 1970 წლის 1 იანვარი? ეს იყო მარტივი, მრგვალი თარიღი Unix-ის შემქმნელებმა ჩათვალეს,
რომ ეს თარიღი საკმარისად ადრე იყო კომპიუტერული სისტემების უმეტესობისთვის 32-ბიტიან სისტემებში ეს იძლეოდა დაახლოებით 
68 წლის დიაპაზონს დადებითი რიცხვებისთვის თვითონ JavaScript-ი კი შეიქმნა გაცილებით გვიან - 1995 წელს, ბრენდან აიხის მიერ Netscape-ისთვის.
თავდაპირველად მას ერქვა Mocha, შემდეგ LiveScript და საბოლოოდ JavaScript.*/
